Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.triggers.sgr.help
source: A sequence of SGR codes specifying the style to apply. Codes are delimited by semicolons. For example, to change text to be bold and red you’d use `1;31`. You may use the following codes: ``` Numeric Code Description ------------ -------------------------- 0 Normal (default) 1 Bold 2 Faint 22 Reset bold and faint 3 Italicized 23 Not italicized 4 Single underline 21 Doubly underlined 4:3 Curly underline 24 Not underlined 58:2:1:R:G:B 24-bit underline color. R, G, and B are values in 0…255. 58:5:I 8-bit underline color. I is a value in 0…255. 5 Blink 25 Reset blink 7 Inverse 27 Reset inverse 8 Invisible 28 Reset invisible 9 Crossed-out 29 Not crossed-out 30 Black text color 31 Red text color 32 Green text color 33 Yellow text color 34 Blue text color 35 Magenta text color 36 Cyan text color 37 White text color 39 Default text color 40 Black background color 41 Red background color 42 Green background color 43 Yellow background color 44 Blue background color 45 Magenta background color 46 Cyan background color 47 White background color 49 Default background color 90 Bright Black text color 91 Bright Red text 92 Bright Green text color 93 Bright Yellow text color 94 Bright Blue text color 95 Bright Magenta text color 96 Bright Cyan text color 97 Bright White text color 100 Bright Black background color 101 Bright Red background 102 Bright Green background color 103 Bright Yellow background color 104 Bright Blue background color 105 Bright Magenta background color 106 Bright Cyan background color 107 Bright White background color 38:2:1:R:G:B 24-bit text color. R, G, and B are values in 0…255. 48:2:1:R:G:B 24-bit background color. R, G, and B are values in 0…255. 38;5;I 8-bit text color. I is a value in 0…255. 48;5;I 8-bit background color. I is a value in 0…255.
zh_hans: 用于指定所应用样式的一组 SGR 代码。代码之间以分号分隔。例如，要将文本设为粗体红色，可使用 `1;31`。可使用以下代码： ``` 数字代码 说明 ------------ -------------------------- 0 正常（默认） 1 粗体 2 淡化 22 重置粗体和淡化 3 斜体 23 取消斜体 4 单下划线 21 双下划线 4:3 波浪下划线 24 取消下划线 58:2:1:R:G:B 24 位下划线颜色。 R、G 和 B 的取值范围为 0…255。 58:5:I 8 位下划线颜色。 I 的取值范围为 0…255。 5 闪烁 25 重置闪烁 7 反相 27 重置反相 8 隐藏 28 取消隐藏 9 删除线 29 取消删除线 30 黑色文本 31 红色文本 32 绿色文本 33 黄色文本 34 蓝色文本 35 品红色文本 36 青色文本 37 白色文本 39 默认文本颜色 40 黑色背景 41 红色背景 42 绿色背景 43 黄色背景 44 蓝色背景 45 品红色背景 46 青色背景 47 白色背景 49 默认背景颜色 90 亮黑色文本 91 亮红色文本 92 亮绿色文本 93 亮黄色文本 94 亮蓝色文本 95 亮品红色文本 96 亮青色文本 97 亮白色文本 100 亮黑色背景 101 亮红色背景 102 亮绿色背景 103 亮黄色背景 104 亮蓝色背景 105 亮品红色背景 106 亮青色背景 107 亮白色背景 38:2:1:R:G:B 24 位文本颜色。 R、G 和 B 的取值范围为 0…255。 48:2:1:R:G:B 24 位背景颜色。 R、G 和 B 的取值范围为 0…255。 38;5;I 8 位文本颜色。 I 的取值范围为 0…255。 48;5;I 8 位背景颜色。 I 的取值范围为 0…255。

# ui.triggers.trigger.content.17caf7f5
source: Content:
zh_hans: 内容：

# ui.triggers.trigger.error_in_trigger_parameter.d2aaef08
source: Error in Trigger Parameter
zh_hans: 触发器参数错误

# ui.triggers.trigger.ok.565339bc
source: OK
zh_hans: 好

source: The following parameter for a “%@” trigger could not be evaluated: %@ The error was: %@
zh_hans: 无法对“%@”触发器的以下参数求值： %@ 错误： %@

# ui.tryingtoohard.itermprintguard.allow.e213c161
source: Allow
zh_hans: 允许

# ui.tryingtoohard.itermprintguard.allow_printing.527be480
source: Allow Printing?
zh_hans: 允许打印吗？

# ui.tryingtoohard.itermprintguard.disable_permanently.ceecb56e
source: Disable Permanently
zh_hans: 永久停用

# ui.tryingtoohard.itermprintguard.disable_temporarily.83810244
source: Disable Temporarily
zh_hans: 暂时停用

# ui.tryingtoohard.itermprintguard.there_s_a_lot_of_printing_going_on.1e732eb3
source: There's a lot of printing going on. Want to keep allowing it?
zh_hans: 正在执行大量打印。要继续允许吗？

source: Rebuilding the Python environment…
zh_hans: 正在重新构建 Python 环境…

# ui.api.itermdependencyeditorwindowcontroller.unknown_error.27c2ccd9
source: Unknown error
zh_hans: 未知错误

# ui.api.itermscriptsmenucontroller.rebuilding_the_python_environment.44036a59
source: Rebuilding the Python environment…
zh_hans: 正在重新构建 Python 环境…

# ui.api.itermscriptsmenucontroller.unknown_error.27c2ccd9
source: Unknown error
zh_hans: 未知错误

# ui.codecs.itermrecordingcodec.unknown_error.27c2ccd9
source: Unknown error
zh_hans: 未知错误

# ui.settings.itermremotepreferences.unknown_error.3e4443e5
source: unknown error
zh_hans: 未知错误

source: This panel helps you configure a new profile that will be bound to a keystroke you assign. Pressing the hotkey (even when iTerm2 is not active) will toggle a special window.
zh_hans: 此面板可帮助你配置一个绑定到指定快捷键的新配置文件。按下该热键（即使 iTerm2 未处于活跃状态）即可显示或隐藏特殊窗口。

source: You already have a Profile with a Hotkey Window named %@
zh_hans: 你已有一个名为 %@ 的热键窗口配置文件

source: You already have Profiles with Hotkey Windows named %@
zh_hans: 你已有多个名为 %@ 的热键窗口配置文件

source: Press “Continue” to run this command:
zh_hans: 按“继续”运行此命令：

source: Waiting for this command to finish:
zh_hans: 正在等待此命令完成：

# ui.statusbar.core.itermstatusbarcontainerview.configure_component.11f4eb50
source: Configure %@
zh_hans: 配置%@

# ui.statusbar.core.itermstatusbarcontainerview.hide_component.93367d5f
source: Hide %@
zh_hans: 隐藏%@

# ui.swift.triggers.hyperlinkbrowsertrigger.nil_parameter.930f8a95
source: (nil)
zh_hans: （无）

# ui.toolbelt.itermtoolsnippets.add.9fd728c6
source: Add
zh_hans: 添加

# ui.toolbelt.itermtoolsnippets.edit.464c4ffd
source: Edit
zh_hans: 编辑

# ui.toolbelt.itermtoolsnippets.open_in_advanced_paste.129127ec
source: Open in Advanced Paste
zh_hans: 在高级粘贴中打开

# ui.toolbelt.itermtoolsnippets.remove.c3812fc4
source: Remove
zh_hans: 移除

# ui.toolbelt.itermtoolsnippets.send.f6f4688f
source: Send
zh_hans: 发送

# ui.triggers.stoptrigger.stop_processing_triggers.d310e6b3
source: Stop Processing Triggers
zh_hans: 停止处理触发器

# ui.triggers.annotatetrigger.annotate.340ab6de
source: Annotate…
zh_hans: 添加注释…

# ui.triggers.annotatetrigger.enter_annotation.6bb93a2f
source: Enter annotation
zh_hans: 输入注释

# ui.triggers.itermrpctrigger.invoke_script_function.44cc0874
source: Invoke Script Function
zh_hans: 调用脚本函数

# ui.triggers.itermrpctrigger.function_call.4d6ea58d
source: Function call
zh_hans: 函数调用

# ui.triggers.itermhyperlinktrigger.make_hyperlink.0df9e2a5
source: Make Hyperlink…
zh_hans: 创建超链接…

# ui.triggers.sendtexttrigger.send_text.31619199
source: Send Text…
zh_hans: 发送文本…

# ui.triggers.sendtexttrigger.enter_text_to_send.da82d0ba
source: Enter text to send
zh_hans: 输入要发送的文本

# ui.triggers.passwordtrigger.open_password_manager.0c283969
source: Open Password Manager…
zh_hans: 打开密码管理器…

# ui.triggers.passwordtrigger.open_password_manager_to_unlock.d7486d12
source: Open Password Manager to Unlock
zh_hans: 打开密码管理器以解锁

# ui.triggers.coprocesstrigger.run_coprocess.18345782
source: Run Coprocess…
zh_hans: 运行协进程…

# ui.triggers.coprocesstrigger.enter_coprocess_command_to_run.5a0f5c0b
source: Enter coprocess command to run
zh_hans: 输入要运行的协进程命令

# ui.triggers.coprocesstrigger.run_silent_coprocess.4269812b
source: Run Silent Coprocess…
zh_hans: 静默运行协进程…

# ui.triggers.itermhighlightlinetrigger.highlight_line.4793c0c9
source: Highlight Line…
zh_hans: 高亮整行…

# ui.triggers.highlighttrigger.highlight_text.b6130a2f
source: Highlight Text…
zh_hans: 高亮文本…

# ui.triggers.marktrigger.set_mark.ae11f7ac
source: Set Mark
zh_hans: 设置标记

# ui.triggers.marktrigger.keep_scrolling.4e9a386c
source: Keep Scrolling
zh_hans: 继续滚动

# ui.triggers.marktrigger.stop_scrolling.1c1df101
source: Stop Scrolling
zh_hans: 停止滚动

# ui.triggers.alerttrigger.show_alert.04011c3d
source: Show Alert…
zh_hans: 显示提醒…

# ui.triggers.alerttrigger.enter_text_to_show_in_alert.734ab54a
source: Enter text to show in alert
zh_hans: 输入提醒中显示的文本

# ui.triggers.capturetrigger.capture_output.2543ca4b
source: Capture Output
zh_hans: 捕获输出

# ui.triggers.capturetrigger.coprocess_to_run_on_activation.d97dd8bc
source: Coprocess to run on activation
zh_hans: 激活时运行的协进程

# ui.triggers.itermusernotificationtrigger.post_notification.c79f0744
source: Post Notification…
zh_hans: 发送通知…

# ui.triggers.itermusernotificationtrigger.enter_message.d23ff7d9
source: Enter Message
zh_hans: 输入消息

# ui.triggers.belltrigger.ring_bell.51710b17
source: Ring Bell
zh_hans: 响铃

# ui.triggers.bouncetrigger.bounce_dock_icon.fb1a9eef
source: Bounce Dock Icon
zh_hans: 弹跳 Dock 图标

# ui.triggers.setdirectorytrigger.report_directory.974789f5
source: Report Directory
zh_hans: 报告目录

# ui.triggers.setdirectorytrigger.directory.c8f84c3c
source: Directory
zh_hans: 目录

# ui.triggers.itermsettitletrigger.set_title.da667022
source: Set Title…
zh_hans: 设置标题…

# ui.triggers.itermsettitletrigger.enter_new_title.02a2d812
source: Enter new title
zh_hans: 输入新标题

# ui.triggers.itermshellprompttrigger.prompt_detected.138fc2a1
source: Prompt Detected
zh_hans: 检测到提示符

# ui.triggers.scripttrigger.run_command.91eb0214
source: Run Command…
zh_hans: 运行命令…

# ui.triggers.scripttrigger.enter_command_to_run.3fcf9c3a
source: Enter command to run
zh_hans: 输入要运行的命令

# ui.triggers.sethostnametrigger.report_user_host.3028a648
source: Report User & Host
zh_hans: 报告用户和主机

# ui.triggers.trigger.job.0ac441de
source: Job: %@
zh_hans: 作业：%@

# ui.triggers.trigger.exit_code_0.956bfd9f
source: exit code 0
zh_hans: 退出代码 0

# ui.triggers.trigger.non_zero_exit_code.653605da
source: non-zero exit code
zh_hans: 非零退出代码

# ui.triggers.trigger.exit_code.26080fc3
source: exit code %@
zh_hans: 退出代码 %@

# ui.triggers.trigger.after_seconds.117e3c7d
source: after %@ seconds
zh_hans: %@ 秒后

# ui.triggers.trigger.matching.c08e19a6
source: matching /%@/
zh_hans: 匹配 /%@/

# ui.triggers.trigger.command.910473b5
source: command /%@/
zh_hans: 命令 /%@/

# ui.triggers.trigger.appeared.79159126
source: appeared
zh_hans: 已出现

# ui.triggers.trigger.disappeared.af5e1459
source: disappeared
zh_hans: 已消失

# ui.triggers.highlighttrigger.yellow_on_black.761765b9
source: Yellow on Black
zh_hans: 黑底黄字

# ui.triggers.highlighttrigger.black_on_yellow.e1ee5d3e
source: Black on Yellow
zh_hans: 黄底黑字

# ui.triggers.highlighttrigger.white_on_red.83b5edbd
source: White on Red
zh_hans: 红底白字

# ui.triggers.highlighttrigger.red_on_white.81fa7d2c
source: Red on White
zh_hans: 白底红字

# ui.triggers.highlighttrigger.black_on_orange.9bec7a8a
source: Black on Orange
zh_hans: 橙底黑字

# ui.triggers.highlighttrigger.orange_on_black.455c2e0e
source: Orange on Black
zh_hans: 黑底橙字

# ui.triggers.highlighttrigger.purple_on_black.3317ead3
source: Purple on Black
zh_hans: 黑底紫字

# ui.triggers.highlighttrigger.black_on_purple.d76ca289
source: Black on Purple
zh_hans: 紫底黑字

# ui.triggers.highlighttrigger.black_foreground.fc077eb5
source: Black Foreground
zh_hans: 黑色前景

# ui.triggers.highlighttrigger.blue_foreground.ceaf9af9
source: Blue Foreground
zh_hans: 蓝色前景

# ui.triggers.highlighttrigger.brown_foreground.b44985bf
source: Brown Foreground
zh_hans: 棕色前景

# ui.triggers.highlighttrigger.cyan_foreground.11db9503
source: Cyan Foreground
zh_hans: 青色前景

# ui.triggers.highlighttrigger.dark_gray_foreground.09e92a52
source: Dark Gray Foreground
zh_hans: 深灰色前景

# ui.triggers.highlighttrigger.gray_foreground.18b5036f
source: Gray Foreground
zh_hans: 灰色前景

# ui.triggers.highlighttrigger.green_foreground.fa77200c
source: Green Foreground
zh_hans: 绿色前景

# ui.triggers.highlighttrigger.light_gray_foreground.852ec861
source: Light Gray Foreground
zh_hans: 浅灰色前景

# ui.triggers.highlighttrigger.magenta_foreground.46eba388
source: Magenta Foreground
zh_hans: 洋红色前景

# ui.triggers.highlighttrigger.orange_foreground.ee40fa4d
source: Orange Foreground
zh_hans: 橙色前景

# ui.triggers.highlighttrigger.purple_foreground.193e532b
source: Purple Foreground
zh_hans: 紫色前景

# ui.triggers.highlighttrigger.red_foreground.00e89ff4
source: Red Foreground
zh_hans: 红色前景

# ui.triggers.highlighttrigger.white_foreground.c12073d6
source: White Foreground
zh_hans: 白色前景

# ui.triggers.highlighttrigger.yellow_foreground.804fd792
source: Yellow Foreground
zh_hans: 黄色前景

# ui.triggers.highlighttrigger.black_background.b04caa23
source: Black Background
zh_hans: 黑色背景

# ui.triggers.highlighttrigger.blue_background.990b650d
source: Blue Background
zh_hans: 蓝色背景

# ui.triggers.highlighttrigger.brown_background.13494d58
source: Brown Background
zh_hans: 棕色背景

# ui.triggers.highlighttrigger.cyan_background.f5cf08c2
source: Cyan Background
zh_hans: 青色背景

# ui.triggers.highlighttrigger.dark_gray_background.04082214
source: Dark Gray Background
zh_hans: 深灰色背景

# ui.triggers.highlighttrigger.gray_background.21c8f560
source: Gray Background
zh_hans: 灰色背景

# ui.triggers.highlighttrigger.green_background.375e1e8f
source: Green Background
zh_hans: 绿色背景

# ui.triggers.highlighttrigger.light_gray_background.6b018f49
source: Light Gray Background
zh_hans: 浅灰色背景

# ui.triggers.highlighttrigger.magenta_background.64552500
source: Magenta Background
zh_hans: 洋红色背景

# ui.triggers.highlighttrigger.orange_background.e283a2e6
source: Orange Background
zh_hans: 橙色背景

# ui.triggers.highlighttrigger.purple_background.0a86ae56
source: Purple Background
zh_hans: 紫色背景

# ui.triggers.highlighttrigger.red_background.be2d0745
source: Red Background
zh_hans: 红色背景

# ui.triggers.highlighttrigger.white_background.c18f4c71
source: White Background
zh_hans: 白色背景

# ui.triggers.highlighttrigger.yellow_background.8222644b
source: Yellow Background
zh_hans: 黄色背景

source: Memory Utilization
zh_hans: 内存使用率

source: Shows current memory utilization.
zh_hans: 显示当前内存使用率。

# ui.statusbar.components.itermstatusbarjobcomponent.job_name.325711f0
source: Job Name
zh_hans: 作业名称

source: Shows the currently running job. If space permits, parent process names are also shown.
zh_hans: 显示当前运行的作业。空间足够时还会显示父进程名称。

# ui.statusbar.components.itermstatusbargitcomponent.git_state.4110d154
source: git state
zh_hans: git 状态

source: Shows a summary of the git state of the current directory.
zh_hans: 显示当前目录的 git 状态摘要。

source: Polling Interval (seconds):
zh_hans: 轮询间隔（秒）：

# ui.statusbar.components.itermstatusbargitcomponent.yes.85a39ab3
source: Yes
zh_hans: 是

# ui.statusbar.components.itermstatusbargitcomponent.no.1ea442a1
source: No
zh_hans: 否

source: Interpolated String
zh_hans: 插值字符串

source: Shows the evaluation of a string with inline expressions which may include session variables or the output of registered scripting functions
zh_hans: 显示含内联表达式的字符串求值结果，表达式可引用会话变量或已注册脚本函数的输出

source: String Value:
zh_hans: 字符串值：

source: String with \(expressions)
zh_hans: 含有 \(expressions) 的字符串

# ui.statusbar.components.itermstatusbarcomposercomponent.icon_color.b77da130
source: Icon Color:
zh_hans: 图标颜色：

source: Background Color:
zh_hans: 背景颜色：

# ui.statusbar.components.itermstatusbarcomposercomponent.composer.9cb2832c
source: Composer
zh_hans: 编写器

source: Adds a text field for composing command lines.
zh_hans: 添加用于编写命令行的文本字段。

# ui.statusbar.components.itermstatusbarcomposercomponent.command.82397e64
source: >_ [Command] 💬
zh_hans: >_ [命令] 💬

source: Download Color:
zh_hans: 下载颜色：

source: Download Text Color:
zh_hans: 下载文本颜色：

source: Upload Color:
zh_hans: 上传颜色：

source: Upload Text Color:
zh_hans: 上传文本颜色：

source: Network Throughput
zh_hans: 网络吞吐量

source: Shows current network throughput.
zh_hans: 显示当前网络吞吐量。

# ui.statusbar.components.itermstatusbarbasecomponent.maximum_width.1a6532ea
source: Maximum Width:
zh_hans: 最大宽度：

# ui.statusbar.components.itermstatusbarbasecomponent.minimum_width.b15ef6bb
source: Minimum Width:
zh_hans: 最小宽度：

# ui.statusbar.components.itermstatusbarbasecomponent.priority.34574af1
source: Priority:
zh_hans: 优先级：

# ui.statusbar.components.itermstatusbartextcomponent.text_color.87715c40
source: Text Color:
zh_hans: 文本颜色：

# ui.statusbar.components.itermstatusbartextcomponent.background_color.2f484fe0
source: Background Color:
zh_hans: 背景颜色：

# ui.statusbar.components.itermstatusbartextcomponent.custom_font.f1b538dd
source: Custom Font
zh_hans: 自定义字体

source: Text Color:
zh_hans: 文本颜色：

# ui.statusbar.components.itermstatusbargraphiccomponent.background_color.2f484fe0
source: Background Color:
zh_hans: 背景颜色：

# ui.statusbar.components.itermstatusbargraphiccomponent.text_color.87715c40
source: Text Color:
zh_hans: 文本颜色：

# ui.statusbar.components.itermstatusbarspringcomponent.empty_space.65263a12
source: Empty Space
zh_hans: 空白区域

# ui.statusbar.components.itermstatusbarspringcomponent.spring.db29e82a
source: Spring
zh_hans: 弹性间隔

source: Empty space that draws only a background color.
zh_hans: 仅绘制背景颜色的空白区域。

source: Pushes items apart. Use one spring to right-align status bar elements that follow it. Use two to center those inbetween.
zh_hans: 推开各项目。使用一个弹性间隔可让后续状态栏元素右对齐；使用两个可让其间的元素居中。

# ui.statusbar.components.itermstatusbarspringcomponent.color.6b73191a
source: Color
zh_hans: 颜色

source: Fixed-size Spacer
zh_hans: 固定大小间隔

source: Adds a fixed amount of space
zh_hans: 添加固定大小的间隔

# ui.statusbar.components.itermstatusbarfixedspacercomponent.color.6b73191a
source: Color
zh_hans: 颜色

# ui.statusbar.components.itermstatusbarfixedspacercomponent.width.3019947b
source: Width
zh_hans: 宽度

# ui.statusbar.components.itermstatusbarsnippetcomponent.snippets_menu.58565b69
source: Snippets Menu
zh_hans: 片段菜单

source: When clicked, opens a menu of snippets. Snippets are saved text strings that can be pasted quickly.
zh_hans: 点击后打开片段菜单。片段是可快速粘贴的已存文本字符串。

# ui.statusbar.components.itermstatusbarsnippetcomponent.snippet.d5c0d6cd
source: Snippet…
zh_hans: 片段…

# ui.statusbar.components.itermstatusbarsnippetcomponent.send_snippet.fec5a180
source: Send Snippet…
zh_hans: 发送片段…

# ui.statusbar.components.itermstatusbarsearchfieldcomponent.search_tool.b81782a8
source: Search Tool
zh_hans: 搜索工具

source: Search tool to find text in the terminal window.
zh_hans: 用于在终端窗口中查找文本的搜索工具。

# ui.statusbar.components.itermstatusbarsearchfieldcomponent.color.6b73191a
source: Color
zh_hans: 颜色

# ui.statusbar.components.itermstatusbarsearchfieldcomponent.search.f7cba4a8
source: 🔎 Search
zh_hans: 🔎 搜索

# ui.statusbar.components.itermstatusbarclockcomponent.clock.93ff9273
source: Clock
zh_hans: 时钟

source: Shows current date and time with a configurable format.
zh_hans: 以可配置的格式显示当前日期和时间。

# ui.statusbar.components.itermstatusbarclockcomponent.date_format.a2c3d2e0
source: Date Format:
zh_hans: 日期格式：

source: Date Format (Unicode TR 35)
zh_hans: 日期格式（Unicode TR 35）

source: Localize Date Format
zh_hans: 本地化日期格式

source: Show server time in SSH integration?
zh_hans: 在 SSH 集成中显示服务器时间？

source: Use server time zone in SSH integration?
zh_hans: 在 SSH 集成中使用服务器时区？

source: Progress Indicator
zh_hans: 进度指示器

source: Generic progress indicator
zh_hans: 通用进度指示器

source: CPU Utilization
zh_hans: CPU 使用率

source: Shows current CPU utilization.
zh_hans: 显示当前 CPU 使用率。

# ui.statusbar.components.itermstatusbarbatterycomponent.show_percentage.600daf45
source: Show Percentage
zh_hans: 显示百分比

source: Show Estimated Time
zh_hans: 显示预计时间

# ui.statusbar.components.itermstatusbarbatterycomponent.battery_level.bece9110
source: Battery Level
zh_hans: 电池电量

source: Shows current battery level and its recent history.
zh_hans: 显示当前电池电量及其近期变化。

# ui.statusbar.components.itermstatusbarplaceholdercomponent.placeholder.f4b24fed
source: Placeholder
zh_hans: 占位符

source: Click here to configure status bar
zh_hans: 点按此处配置状态栏

# ui.statusbar.components.itermstatusbarfunctioncallcomponent.label.6401be67
source: Label:
zh_hans: 标签：

source: Button Label
zh_hans: 按钮标签

source: Function call:
zh_hans: 函数调用：

source: Timeout (seconds):
zh_hans: 超时（秒）：

# ui.statusbar.components.itermstatusbarfunctioncallcomponent.text_color.87715c40
source: Text Color:
zh_hans: 文本颜色：

source: Call Script Function
zh_hans: 调用脚本函数

source: Adds a button that invokes a script function with a user-provided invocation.
zh_hans: 添加一个按钮，用于通过用户提供的调用来执行脚本函数。

# ui.statusbar.components.itermstatusbaractioncomponent.action.64cff131
source: Action
zh_hans: 操作

# ui.statusbar.components.itermstatusbaractioncomponent.custom_action.a06fc9bb
source: Custom Action
zh_hans: 自定义操作

source: Adds a button that performs a user-configurable action, similar to a key binding.
zh_hans: 添加一个执行用户可配置操作的按钮，类似于按键绑定。

# ui.statusbar.components.itermstatusbaractioncomponent.actions_menu.8e1d66d2
source: Actions Menu
zh_hans: 操作菜单

source: When clicked, opens a menu of actions. Actions are like custom key bindings, but without a keystroke attached.
zh_hans: 点击后打开操作菜单。操作类似于自定义按键绑定，但不关联按键。

# ui.statusbar.components.itermstatusbaractioncomponent.action.71b8442b
source: Action…
zh_hans: 操作…

# ui.statusbar.components.itermstatusbaractioncomponent.perform_action.2f012ea3
source: Perform Action…
zh_hans: 执行操作…

source: localhost replacement
zh_hans: localhost 替换文本

source: Enter replacement text for localhost
zh_hans: 输入 localhost 的替换文本

# ui.statusbar.components.itermstatusbarvariablebasecomponent.host_name.8bdf40f5
source: Host Name
zh_hans: 主机名

source: Current host name. Requires shell integration.
zh_hans: 当前主机名。需要 Shell 集成。

# ui.statusbar.components.itermstatusbarvariablebasecomponent.user_name.a969d04e
source: User Name
zh_hans: 用户名

source: Current user name. Requires shell integration.
zh_hans: 当前用户名。需要 Shell 集成。

source: Current Directory
zh_hans: 当前目录

source: Current directory. Best with shell integration.
zh_hans: 当前目录。配合 Shell 集成使用效果最佳。

# ui.keyboard.itermkeybindingaction.by_line.4336aa4e
source: By Line
zh_hans: 按行

# ui.keyboard.itermkeybindingaction.by_character.cb408196
source: By Character
zh_hans: 按字符

# ui.keyboard.itermkeybindingaction.by_word.0c427b55
source: By Word
zh_hans: 按单词

# ui.keyboard.itermkeybindingaction.by_word.9bc5ed38
source: By WORD
zh_hans: 按 WORD

# ui.keyboard.itermkeybindingaction.by_mark.5cc4083a
source: By Mark
zh_hans: 按标记

# ui.keyboard.itermkeybindingaction.move_tab_left.42478433
source: Move Tab Left
zh_hans: 向左移动标签页

# ui.keyboard.itermkeybindingaction.move_tab_right.8b396b2f
source: Move Tab Right
zh_hans: 向右移动标签页

# ui.keyboard.itermkeybindingaction.cycle_tabs_forward.b32ee6f9
source: Cycle Tabs Forward
zh_hans: 向前循环切换标签页

# ui.keyboard.itermkeybindingaction.cycle_tabs_backward.749377ea
source: Cycle Tabs Backward
zh_hans: 向后循环切换标签页

# ui.keyboard.itermkeybindingaction.next_pane.1dd89542
source: Next Pane
zh_hans: 下一个窗格

# ui.keyboard.itermkeybindingaction.previous_pane.b8a94609
source: Previous Pane
zh_hans: 上一个窗格

# ui.keyboard.itermkeybindingaction.next_tab.a9426fb3
source: Next Tab
zh_hans: 下一个标签页

# ui.keyboard.itermkeybindingaction.next_window.95bf685f
source: Next Window
zh_hans: 下一个窗口

# ui.keyboard.itermkeybindingaction.previous_tab.80f06bdc
source: Previous Tab
zh_hans: 上一个标签页

# ui.keyboard.itermkeybindingaction.previous_window.4c8b1a6d
source: Previous Window
zh_hans: 上一个窗口

# ui.keyboard.itermkeybindingaction.scroll_to_end.ca74a991
source: Scroll To End
zh_hans: 滚动到底部

# ui.keyboard.itermkeybindingaction.scroll_to_top.81fcba37
source: Scroll To Top
zh_hans: 滚动到顶部

# ui.keyboard.itermkeybindingaction.scroll_one_line_down.64145602
source: Scroll One Line Down
zh_hans: 向下滚动一行

# ui.keyboard.itermkeybindingaction.scroll_one_line_up.1f23d92d
source: Scroll One Line Up
zh_hans: 向上滚动一行

# ui.keyboard.itermkeybindingaction.scroll_one_page_down.c5172032
source: Scroll One Page Down
zh_hans: 向下滚动一页

# ui.keyboard.itermkeybindingaction.scroll_one_page_up.002851cd
source: Scroll One Page Up
zh_hans: 向上滚动一页

# ui.keyboard.itermkeybindingaction.send.9327d569
source: Send ^[ %@
zh_hans: 发送 ^[ %@

# ui.keyboard.itermkeybindingaction.send_hex_codes.ae255749
source: Send Hex Codes: %@
zh_hans: 发送十六进制代码：%@

# ui.keyboard.itermkeybindingaction.send.7b2f6b4e
source: Send: "%@"
zh_hans: 发送：“%@”

# ui.keyboard.itermkeybindingaction.send_no_broadcast.24f39209
source: Send (no broadcast): "%@"
zh_hans: 发送（不广播）：“%@”

# ui.keyboard.itermkeybindingaction.send_snippet.186b12f4
source: Send Snippet “%@”
zh_hans: 发送片段“%@”

# ui.keyboard.itermkeybindingaction.send_deleted_snippet_no_action.4c2fc4ad
source: Send Deleted Snippet (no action)
zh_hans: 发送已删除的片段（无操作）

# ui.keyboard.itermkeybindingaction.compose.4712ae1a
source: Compose “%@”
zh_hans: 编写“%@”

# ui.keyboard.itermkeybindingaction.run_coprocess.fa0ddee1
source: Run Coprocess "%@"
zh_hans: 运行协进程“%@”
